; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_1 type_2)
 (:predicates (pred_4 ?v6 - type_1 ?v5 - type_3)
 	      (pred_2 ?v8 - object ?v5 - type_3)
	      (pred_3 ?v6 - type_1 ?v2 - type_2)
	      (pred_1 ?v6 - type_1 ?v8 - object ?v2 - type_2))

   (:action op_2
       :parameters  (?v6 - type_1 ?v7 ?v4 - type_3)
       :precondition (and  (pred_4 ?v6 ?v7))
       :effect (and  (pred_4 ?v6 ?v4)
		     (not (pred_4 ?v6 ?v7))))

   (:action op_1
       :parameters (?v6 - type_1 ?v1 - object ?v3 - type_3 ?v2 - type_2)
       :precondition  (and  (pred_2 ?v1 ?v3) (pred_4 ?v6 ?v3) (pred_3 ?v6 ?v2))
       :effect (and (pred_1 ?v6 ?v1 ?v2)
		    (not (pred_2 ?v1 ?v3)) 
		    (not (pred_3 ?v6 ?v2))))

   (:action op_3
       :parameters (?v6 - type_1 ?v1 - object ?v3 - type_3 ?v2 - type_2)
       :precondition  (and  (pred_1 ?v6 ?v1 ?v2) (pred_4 ?v6 ?v3))
       :effect (and (pred_2 ?v1 ?v3)
		    (pred_3 ?v6 ?v2)
		    (not (pred_1 ?v6 ?v1 ?v2)))))

; problem
(define (problem gripper-2-3-3)
(:domain gripper-strips)
(:objects obj_11 obj_02 - type_1
obj_05 obj_12 obj_04 obj_09 - type_2
obj_08 obj_07 obj_01 - type_3
obj_06 obj_03 obj_10 - object)
(:init
(pred_4 obj_11 obj_08)
(pred_3 obj_11 obj_05)
(pred_3 obj_11 obj_12)
(pred_4 obj_02 obj_08)
(pred_3 obj_02 obj_04)
(pred_3 obj_02 obj_09)
(pred_2 obj_06 obj_08)
(pred_2 obj_03 obj_07)
(pred_2 obj_10 obj_01)
)
(:goal
(and
(pred_2 obj_06 obj_07)
(pred_2 obj_03 obj_01)
(pred_2 obj_10 obj_01)
)
)

(:constraints
  (always (not (pred_4 obj_11 obj_01)))
)
)

; plan
1. (op_1 obj_11 obj_06 obj_08 obj_12)
   deleted: (pred_2 obj_06 obj_08) (pred_3 obj_11 obj_12)
   added: (pred_1 obj_11 obj_06 obj_12)
   goals met: 1 of 3
2. (op_2 obj_02 obj_08 obj_07)
   deleted: (pred_4 obj_02 obj_08)
   added: (pred_4 obj_02 obj_07)
   goals met: 1 of 3
3. (op_2 obj_11 obj_08 obj_07)
   deleted: (pred_4 obj_11 obj_08)
   added: (pred_4 obj_11 obj_07)
   goals met: 1 of 3
4. (op_1 obj_11 obj_03 obj_07 obj_05)
   deleted: (pred_2 obj_03 obj_07) (pred_3 obj_11 obj_05)
   added: (pred_1 obj_11 obj_03 obj_05)
   goals met: 1 of 3
5. (op_3 obj_11 obj_06 obj_07 obj_12)
   deleted: (pred_1 obj_11 obj_06 obj_12)
   added: (pred_2 obj_06 obj_07) (pred_3 obj_11 obj_12)
   goals met: 2 of 3
6. (op_3 obj_11 obj_03 obj_07 obj_05)
   deleted: (pred_1 obj_11 obj_03 obj_05)
   added: (pred_2 obj_03 obj_07) (pred_3 obj_11 obj_05)
   goals met: 2 of 3
7. (op_1 obj_02 obj_03 obj_07 obj_09)
   deleted: (pred_2 obj_03 obj_07) (pred_3 obj_02 obj_09)
   added: (pred_1 obj_02 obj_03 obj_09)
   goals met: 2 of 3
8. (op_2 obj_02 obj_07 obj_01)
   deleted: (pred_4 obj_02 obj_07)
   added: (pred_4 obj_02 obj_01)
   goals met: 2 of 3
9. (op_3 obj_02 obj_03 obj_01 obj_09)
   deleted: (pred_1 obj_02 obj_03 obj_09)
   added: (pred_2 obj_03 obj_01) (pred_3 obj_02 obj_09)
   goals met: 3 of 3
